Repository: Leafuke/FolderRewind
Catalog: FolderRewind/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# KnotLinkCompatibility_UnknownVersion
source: unknown
zh_cn: 未知

# KnotLinkCompatibility_UpdateNow
source: Update Now
zh_cn: 立即更新

# KnotLinkCompatibility_RemindLater
source: Remind Me Later
zh_cn: 稍后提醒

# KnotLinkCompatibility_UpdateInfoUnavailable
source: Unable to retrieve the latest KnotLink server release information.
zh_cn: 无法获取 KnotLink 服务端的最新版本信息。

# KnotLinkCompatibility_LatestVersionUnsupported
source: The latest official version, {0}, is older than FolderRewind's minimum required version, {1}.
zh_cn: 官方最新版本 {0} 低于 FolderRewind 要求的最低版本 {1}。

# KnotLinkCompatibility_DownloadFailed
source: Failed to download the KnotLink server installer.
zh_cn: KnotLink 服务端安装程序下载失败。

# KnotLinkCompatibility_UpdateFailedTitle
source: KnotLink Server Update Failed
zh_cn: KnotLink 服务端更新失败

# KnotLinkCompatibility_UpdateFailedContent
source: {0} You can open the official KnotLink releases page and download the installer manually.
zh_cn: {0} 你可以打开 KnotLink 官方发布页手动下载安装程序。

# KnotLinkCompatibility_OpenReleases
source: Open Official Releases
zh_cn: 打开官方下载页

# Common_Save
source: Save
zh_cn: 保存

# Common_Required
source: Required
zh_cn: 必填

# Plugins_SettingsDialogTitle
source: Plugin settings - {0}
zh_cn: 插件设置 - {0}

# Plugins_SettingsMissingRequired
source: Please fill the required field: {0}
zh_cn: 请填写必填项：{0}

# BackupConfig_DefaultSummary
source: No status
zh_cn: 暂无状态

# History_FileMissing
source: File missing
zh_cn: 文件丢失

# Common_Tip
source: Tip
zh_cn: 提示

# SettingsPage_Hotkeys.Text
source: Shortcuts & Hotkeys
zh_cn: 快捷键与热键

# SettingsPage_HotkeysDesc.Text
source: Customize in-app shortcuts and global hotkeys (plugins can also provide bindings).
zh_cn: 自定义应用内快捷键与全局热键（插件也可提供）。

# SettingsPage_Hotkeys_Edit.Content
source: Edit
zh_cn: 编辑

# SettingsPage_Hotkeys_Reset.Content
source: Reset
zh_cn: 恢复默认

# Hotkeys_BackupSelected_DisplayName
source: Backup selected folder
zh_cn: 备份选中文件夹

# Hotkeys_BackupSelected_Description
source: Back up the selected folder in the Manager page.
zh_cn: 在“管理”页选中一个文件夹后触发备份。

# Hotkeys_Scope_Global
source: Global hotkey
zh_cn: 热键（全局）

# Hotkeys_Scope_Shortcut
source: In-app shortcut
zh_cn: 快捷键（应用内）

# Hotkeys_Owner_Core
source: Source: built-in
zh_cn: 来源：内置

# Hotkeys_Owner_Plugin
source: Source: plugin {0}
zh_cn: 来源：插件 {0}

# Hotkeys_Unbound
source: (unbound)
zh_cn: （未绑定）

# Hotkeys_Default
source: Default: {0}
zh_cn: 默认：{0}

# Hotkeys_CapturePlaceholder
source: Click here and press a key combination…
zh_cn: 点击此处后按下组合键…

# Hotkeys_CaptureHint
source: Focus the box and press the desired key combination.
zh_cn: 请把焦点放到输入框，然后按下你想要的组合键。

# Hotkeys_EditDialogTitle
source: Edit shortcut/hotkey
zh_cn: 编辑快捷键/热键

# Hotkeys_Disable
source: Disable
zh_cn: 禁用

# Hotkeys_NoCapture
source: No valid key combination captured.
zh_cn: 未捕获到有效按键组合。

# Hotkeys_ConflictDialog
source: The key combo {0} is already used by "{1}". Please choose another one.
zh_cn: 组合键 {0} 已被“{1}”使用。请更换。

# Hotkeys_InvalidGestureSkipped
source: Invalid hotkey binding skipped: {0} = {1}
zh_cn: 快捷键配置无效，已跳过：{0} = {1}

# Hotkeys_ConflictShortcut
source: Shortcut conflict: {0} is used by {1}; skipping {2}
zh_cn: 快捷键冲突：{0} 已用于 {1}，跳过 {2}

# Hotkeys_ConflictGlobal
source: Global hotkey conflict: {0} is used by {1}; skipping {2}
zh_cn: 热键冲突：{0} 已用于 {1}，跳过 {2}

# Hotkeys_RegisterGlobalFailed
source: Failed to register global hotkey: {0} = {1} (Win32={2})
zh_cn: 注册全局热键失败：{0} = {1} (Win32={2})

# Hotkeys_GlobalHookFailed
source: Failed to install global hotkey window hook: {0}
zh_cn: 安装全局热键窗口钩子失败：{0}

# Hotkeys_InvokeFailed
source: Hotkey callback failed: {0}
zh_cn: 快捷键/热键回调失败：{0}

# SettingsPage_CloseBehavior.Text
source: Close button behavior
zh_cn: 关闭窗口按钮行为

# SettingsPage_CloseBehaviorDesc.Text
source: Choose what happens when you click the close button.
zh_cn: 设置点击窗口关闭按钮时的行为。

# SettingsPage_CloseBehavior_Ask.Content
source: Ask every time
zh_cn: 每次询问

# SettingsPage_CloseBehavior_MinimizeToTray.Content
source: Minimize to tray
zh_cn: 最小化到系统托盘

# SettingsPage_CloseBehavior_Exit.Content
source: Exit
zh_cn: 直接退出

# CloseDialog_Title
source: Close app
zh_cn: 关闭应用

# CloseDialog_Content
source: What should happen when you close the window?
zh_cn: 关闭窗口时执行什么操作？

# CloseDialog_MinimizeToTray
source: Minimize to tray
zh_cn: 最小化到托盘

# CloseDialog_Exit
source: Exit
zh_cn: 直接退出

# CloseDialog_Remember
source: Remember my choice
zh_cn: 记住我的选择

# HistoryPage_DeleteButton.ToolTipService.ToolTip
source: Delete
zh_cn: 删除

# History_DeleteConfirm_Title
source: Delete history
zh_cn: 删除历史记录

# History_DeleteConfirm_Content
source: You are about to process this history entry: {0} Choose whether to remove only the record, only the local backup file, or both. Cloud data will not be deleted.
zh_cn: 将要处理该条历史记录：{0} 请选择仅删除记录、仅删除本地备份文件，或同时删除本地备份与记录。云端副本不会被移除。

# History_ClearMissingConfirm_Title
source: Clear missing records
zh_cn: 清除失效记录

# History_ClearMissingConfirm_Content
source: You are about to remove {0} unrecoverable records (no local file and no cloud copy). This will not delete any existing backup files or cloud data.
zh_cn: 将要清除 {0} 条不可恢复的失效记录（本地与云端都不存在可用副本）。此操作不会影响任何现存备份文件或云端数据。

# History_ClearMissingConfirm_Primary
source: Clear
zh_cn: 清除

# SettingsPage_HistoryStatusColors.Text
source: History status colors
zh_cn: 历史状态颜色

# SettingsPage_HistoryStatusColorsDesc.Text
source: Use different colors in History to distinguish OK vs missing entries (can also be toggled on the History page).
zh_cn: 在历史记录页用不同颜色区分正常与失效记录（也可在历史页临时切换）。

# HistoryPage_ViewButton.ToolTipService.ToolTip
source: View in Explorer
zh_cn: 在资源管理器中查看

# HistoryPage_EditCommentButton.ToolTipService.ToolTip
source: Edit comment
zh_cn: 修改注释

# History_ViewFile_PathEmpty
source: Cannot retrieve backup file path
zh_cn: 无法获取备份文件路径

# History_ViewFile_NotFound
source: Backup file not found: {0}
zh_cn: 备份文件不存在：{0}

# History_ViewFile_Failed
source: Failed to open file: {0}
zh_cn: 打开文件失败：{0}

# History_EditComment_Title
source: Edit comment
zh_cn: 修改注释

# History_EditComment_Placeholder
source: Enter backup comment (optional)
zh_cn: 输入备份注释（可留空）

# SettingsPage_EnableNotifications.Text
source: Enable notifications
zh_cn: 启用通知提醒

# SettingsPage_EnableNotificationsDesc.Text
source: Show in-app notifications and system alerts
zh_cn: 启用后将显示应用内通知和系统弹窗

# Notification_Success_Title
source: Success
zh_cn: 成功

# Notification_Warning_Title
source: Warning
zh_cn: 警告

# Notification_Error_Title
source: Error
zh_cn: 错误

# Notification_Info_Title
source: Info
zh_cn: 提示

# Notification_Action_View
source: View
zh_cn: 查看

# Notification_BackupCompleted_Title
source: Backup complete
zh_cn: 备份完成

# Notification_BackupCompleted_Success
source: Folder "{0}" backed up successfully
zh_cn: 文件夹 "{0}" 已成功备份

# Notification_BackupCompleted_Failed
source: Folder "{0}" backup failed: {1}
zh_cn: 文件夹 "{0}" 备份失败：{1}

# Notification_BackupFailed_Title
source: Backup failed
zh_cn: 备份失败

# Notification_RestoreCompleted_Title
source: Restore complete
zh_cn: 还原完成

# Notification_RestoreCompleted_Success
source: Folder "{0}" restored successfully
zh_cn: 文件夹 "{0}" 已成功还原

# Notification_RestoreCompleted_Failed
source: Folder "{0}" restore failed: {1}
zh_cn: 文件夹 "{0}" 还原失败：{1}

# CloudSync_Notification_Title
source: Cloud archive
zh_cn: 云存档

# CloudSync_Notification_UploadFailed
source: Cloud upload failed for folder "{0}": {1}
zh_cn: 文件夹 "{0}" 的云上传失败：{1}

# CloudSync_Task_Name
source: {0} · Cloud Upload
zh_cn: {0} · 云上传

# CloudSync_Task_Queued
source: Queued for upload...
zh_cn: 等待上传...

# CloudSync_Task_Preparing
source: Preparing upload...
zh_cn: 准备上传...

# CloudSync_Task_Running
source: Uploading...
zh_cn: 正在上传...

# CloudSync_Task_Retrying
source: Retrying upload ({0}/{1})...
zh_cn: 正在重试上传 ({0}/{1})...

# CloudSync_Task_Completed
source: Cloud upload completed
zh_cn: 云上传完成

# CloudSync_Task_Failed
source: Cloud upload failed
zh_cn: 云上传失败

# CloudSync_Task_Timeout
source: Command timed out after {0} seconds
zh_cn: 命令执行超时（{0} 秒）

# CloudSync_Log_MissingArchive
source: Backup archive to upload was not found: {0}
zh_cn: 未找到待上传的备份文件：{0}

# CloudSync_Log_WorkingDirectoryMissing
source: Working directory does not exist: {0}
zh_cn: 工作目录不存在：{0}

# CloudSync_Log_Queued
source: Queued cloud upload for folder "{0}": {1}
zh_cn: 已将文件夹 "{0}" 的云上传加入队列：{1}

# CloudSync_Log_CommandStart
source: Starting cloud command: {0}
zh_cn: 开始执行云命令：{0}

# CloudSync_Log_CommandSucceeded
source: Cloud upload completed for folder "{0}"
zh_cn: 文件夹 "{0}" 的云上传已完成

# CloudSync_Log_CommandFailed
source: Cloud upload failed for folder "{0}": {1}
zh_cn: 文件夹 "{0}" 的云上传失败：{1}

# CloudSync_Error_ExecutableEmpty
source: No executable path is configured
zh_cn: 未设置要执行的程序路径

# CloudSync_Error_StartFailed
source: Failed to start cloud upload command
zh_cn: 无法启动云上传命令

# CloudSync_Error_ExitCode
source: Command failed with exit code: {0}
zh_cn: 命令执行失败，退出码：{0}

# Common_ToggleOn
source: On
zh_cn: 开

# Common_ToggleOff
source: Off
zh_cn: 关

# SettingsPage_About_Link_QQ_GROUP.Content
source: Join QQ Group
zh_cn: 加入 QQ 群

# SettingsPage_Notifications.Text
source: Notifications
zh_cn: 通知

# SettingsPage_NotificationsDesc.Text
source: Configure in-app notifications, system toasts, and warning rules
zh_cn: 配置应用内通知、系统弹窗与警告规则

# SettingsPage_FileSizeWarningThreshold.Text
source: File size warning threshold
zh_cn: 文件大小警告阈值

# SettingsPage_FileSizeWarningThresholdDesc.Text
source: Trigger a warning when backup files are smaller than this threshold. Set to 0 to disable.
zh_cn: 备份文件小于此阈值时触发警告，设为 0 可禁用

# BackupService_Log_FileSizeTooSmall
source: Warning: Backup file for "{0}" is only {1} KB, below threshold {2} KB
zh_cn: 警告：文件夹 "{0}" 的备份文件仅 {1} KB，小于阈值 {2} KB

# BackupService_Warning_FileSizeTooSmall
source: Backup file for "{0}" is only {1} KB, below threshold {2} KB. Please verify backup integrity
zh_cn: 文件夹 "{0}" 的备份文件仅 {1} KB，小于警告阈值 {2} KB，请检查备份是否完整

# BackupService_Log_PostBackupCleanupFailed
source: Warning: post-backup cleanup failed for folder "{0}": {1}
zh_cn: 警告：文件夹 "{0}" 的备份后清理失败：{1}

# BackupService_Warning_PostBackupCleanupFailed
source: Backup for folder "{0}" completed, but keep-count cleanup failed: {1}
zh_cn: 文件夹 "{0}" 的备份已完成，但数量限制清理失败：{1}

# SettingsPage_EnableNotices.Text
source: Receive announcements
zh_cn: 接收公告通知

# SettingsPage_EnableNoticesDesc.Text
source: When enabled, check and display developer announcements on startup
zh_cn: 启用后将在启动时检查并显示开发者公告

# Notice_DialogTitle
source: Announcement
zh_cn: 公告

# Notice_DismissButton
source: Got it, don't show again
zh_cn: 知道了，不再提示

# Notice_RemindLaterButton
source: Remind me later
zh_cn: 稍后提醒

# Notice_FetchFailed
source: Failed to fetch announcement: {0}
zh_cn: 公告获取失败：{0}

# FolderManager_MiniWindow.Text
source: Mini Window
zh_cn: Mini 窗口

# MiniWindow_CommentPlaceholder
source: Comment, then Enter to backup...
zh_cn: 输入备注后回车备份...

# MiniWindow_Menu_OpenFolder
source: Open folder
zh_cn: 打开文件夹

# MiniWindow_Menu_Backup
source: Backup now
zh_cn: 立即备份

# MiniWindow_Menu_Close
source: Close
zh_cn: 关闭

# MiniWindow_Menu_ExpandLeft
source: Prefer expanding left
zh_cn: 优先向左展开

# MiniWindow_Menu_ExpandRight
source: Prefer expanding right
zh_cn: 优先向右展开

# MiniWindow_Tip_Normal
source: No changes
zh_cn: 无变更

# MiniWindow_Tip_Changed
source: Changes detected
zh_cn: 检测到变更

# MiniWindow_Tip_BackingUp
source: Backing up...
zh_cn: 备份中...

# MiniWindow_Tip_Done
source: Backup completed
zh_cn: 备份完成

# MiniWindow_Tip_Failed
source: Backup failed
zh_cn: 备份失败

# MiniWindow_Tip_Format
source: {0} {1} Last backup: {2} Status: {3}
zh_cn: {0} {1} 上次备份：{2} 状态：{3}

# MiniWindow_BackupComment_Hotkey
source: [Hotkey]
zh_cn: [热键]

# MiniWindow_Log_Opened
source: Mini window opened: {0}
zh_cn: Mini 窗口已打开：{0}

# MiniWindow_Log_OpenFailed
source: Failed to open Mini window: {0}
zh_cn: Mini 窗口打开失败：{0}

# MiniWindow_Log_BackupFailed
source: Mini window backup failed: {0}
zh_cn: Mini 窗口备份失败：{0}

# MiniWindow_Log_NoActiveWindow
source: No active Mini window for hotkey
zh_cn: 热键触发时没有活跃的 Mini 窗口

# MiniWindow_Log_HotkeyBackupFailed
source: Mini hotkey backup failed: {0}
zh_cn: Mini 热键备份失败：{0}

# MiniWindow_Log_HotkeyRegisterFailed
source: Failed to register Mini hotkey: {0}
zh_cn: Mini 热键注册失败：{0}

# Hotkeys_MiniBackup_DisplayName
source: Mini backup
zh_cn: Mini 备份

# Hotkeys_MiniBackup_Description
source: Trigger backup on the last focused Mini window (global hotkey)
zh_cn: 对最近获得焦点的 Mini 窗口执行备份（全局热键）

# ConfigSettingsDialog_StopAfterNoChange.Header
source: Stop auto task after repeated no changes
zh_cn: 重复未发现变更后停止自动任务

# ConfigSettingsDialog_StopAfterNoChange.OnContent
source: On
zh_cn: 开启

# ConfigSettingsDialog_StopAfterNoChange.OffContent
source: Off
zh_cn: 关闭

# ConfigSettingsDialog_StopAfterNoChangePrefix.Text
source: Stop after
zh_cn: 连续

# ConfigSettingsDialog_StopAfterNoChangeSuffix.Text
source: consecutive times with no changes
zh_cn: 次未发现变更后自动停止

# AutoBackup_StoppedNoChanges
source: Auto backup for "{0}" has been disabled: no changes detected {1} consecutive times.
zh_cn: “{0}” 的自动备份已停止：连续 {1} 次未检测到变更。

# AutoBackup_Reason_AppStart
source: Run when app starts
zh_cn: 应用启动时运行

# AutoBackup_Reason_Interval
source: Interval backup (every {0} minutes)
zh_cn: 间隔备份（每 {0} 分钟）

# AutoBackup_Reason_Scheduled
source: Scheduled backup ({0})
zh_cn: 计划备份（{0}）

# AutoBackup_Reason_FileUnlocked
source: Conditional backup ({0} unlocked)
zh_cn: 条件备份（{0} 已解除占用）

# AutoBackup_Log_TriggeredConfig
source: [AutoBackup] {0}: {1}
zh_cn: [自动备份] {0}：{1}

# AutoBackup_Log_TriggeredFolder
source: [AutoBackup] {0}: {1} / {2}
zh_cn: [自动备份] {0}：{1} / {2}

# AutoBackup_Log_SingleTargetMissing
source: [AutoBackup] The single-folder automation target for "{0}" no longer exists, so this trigger was skipped.
zh_cn: [自动备份] “{0}” 配置的单文件夹自动化目标已不存在，已跳过本次触发。

# AutoBackup_Log_ConditionLocked
source: [AutoBackup] Condition file became locked: {0} / {1} / {2}
zh_cn: [自动备份] 条件文件已进入占用：{0} / {1} / {2}

# AutoBackup_Log_ConditionUnlocked
source: [AutoBackup] Condition file became unlocked: {0} / {1} / {2}
zh_cn: [自动备份] 条件文件已解除占用：{0} / {1} / {2}

# AutoBackup_Log_StopSkippedBecauseLocked
source: [AutoBackup] level.dat is still locked under "{0}", so auto backup will not be stopped yet.
zh_cn: [自动备份] 检测到“{0}”下的 level.dat 正被占用，暂不停止自动备份。

# AutoBackup_Log_DisabledNoChanges
source: [AutoBackup] "{0}" was disabled after {1} consecutive runs with no changes.
zh_cn: [自动备份] “{0}”已因连续 {1} 次无变更而停止。

# AutoBackup_Log_Failed
source: [AutoBackup] "{0}" failed: {1}
zh_cn: [自动备份] “{0}”执行失败：{1}

# AutoBackup_Notification_Failed
source: Auto backup for "{0}" failed: {1}
zh_cn: “{0}” 的自动备份执行失败：{1}

# ConfigSettingsDialog_AutomationScope_AllFolders
source: All folders
zh_cn: 全部文件夹

# ConfigSettingsDialog_AutomationScope_SingleFolder
source: Single folder
zh_cn: 单独文件夹

# ConfigSettingsDialog_AutomationScopeAllDesc
source: Startup, interval, scheduled, and conditional automation all apply to every folder in this backup project.
zh_cn: 启动、间隔、计划和条件自动化默认作用于当前备份项目下的全部文件夹。

# ConfigSettingsDialog_AutomationScopeSingleDesc
source: Startup, interval, scheduled, and conditional automation only apply to the selected folder below.
zh_cn: 启动、间隔、计划和条件自动化仅作用于下方选中的单个文件夹。

# ConfigSettingsDialog_AutomationTargetFolderDesc
source: When automation scope is set to a single folder, every automation trigger only processes the folder selected here.
zh_cn: 当自动化作用范围为单独文件夹时，所有自动化触发器都只会处理这里选择的文件夹。

# ConfigSettingsDialog_AutomationTargetFolderEmpty
source: There are no source folders available in this backup project yet.
zh_cn: 当前备份项目下还没有可供选择的源文件夹。

# ConfigSettingsDialog_ConditionRelativePathDesc
source: Interpreted relative to each source folder. For example, entering session.lock checks the lock state of "source-folder\\session.lock".
zh_cn: 按源文件夹相对路径解释。例如填写 session.lock 后，会检查“源文件夹\\session.lock”的占用状态变化。

# ConfigSettingsDialog_ConditionRelativePathWarning
source: Conditional backup mode will not trigger until a relative path is provided.
zh_cn: 未填写条件文件相对路径时，条件备份模式不会实际触发。

# ConfigSettingsDialog_ConditionRelativePathAbsoluteWarning
source: Only relative paths are supported for now. Absolute paths will not trigger conditional backup.
zh_cn: 当前仅支持相对路径，不支持绝对路径；填写绝对路径时条件备份不会触发。

# SettingsPage_DataMigration.Text
source: Data migration
zh_cn: 数据迁移

# SettingsPage_DataMigrationDesc.Text
source: Import or export configurations and history for migration across devices
zh_cn: 导入或导出配置与历史记录，便于跨设备迁移

# SettingsPage_ConfigData.Text
source: Configuration
zh_cn: 配置数据

# SettingsPage_ConfigDataDesc.Text
source: Export the current configuration or import a previously exported configuration file. Importing will replace all current settings.
zh_cn: 导出当前配置或导入之前导出的配置文件。导入将替换所有当前设置。

# SettingsPage_ExportConfig.Content
source: Export Configuration
zh_cn: 导出配置

# SettingsPage_ImportConfig.Content
source: Import Configuration
zh_cn: 导入配置

# SettingsPage_HistoryData.Text
source: History Records
zh_cn: 历史记录

# SettingsPage_HistoryDataDesc.Text
source: Export or import backup history records. When importing, you can choose to merge or replace existing records.
zh_cn: 导出或导入备份历史记录。导入时可选择合并或替换现有记录。

# SettingsPage_ExportHistory.Content
source: Export History
zh_cn: 导出历史记录

# SettingsPage_ImportHistory.Content
source: Import History
zh_cn: 导入历史记录

# Settings_ExportConfigSuccess
source: Configuration exported successfully.
zh_cn: 配置导出成功。

# Settings_ExportConfigFailed
source: Failed to export configuration.
zh_cn: 配置导出失败。

# Settings_ExportConfigMode_Title
source: Export Configuration
zh_cn: 导出配置

# Settings_ExportConfigMode_Description
source: Choose whether to export to a local file or directly to the cloud.
zh_cn: 选择要导出到本地文件，还是直接导出到云端。

# Settings_ImportConfigConfirmTitle
source: Import Configuration
zh_cn: 导入配置

# Settings_ImportConfigMode_Title
source: Import Configuration
zh_cn: 导入配置

# Settings_ImportConfigMode_Description
source: Choose whether to import from a local file or directly from the cloud.
zh_cn: 选择从本地文件导入，还是直接从云端导入配置。

# Settings_ImportConfigConfirmContent
source: Importing will replace all current settings and backup configurations. A backup of the current config will be created automatically. Continue?
zh_cn: 导入将替换所有当前设置和备份配置。系统会自动创建当前配置的备份。是否继续？

# Common_Confirm
source: Confirm
zh_cn: 确认

# Settings_ImportConfigSuccess
source: Configuration imported successfully. Some settings may require a restart to take effect.
zh_cn: 配置导入成功。部分设置可能需要重启应用才能生效。

# Settings_ImportConfigFailed
source: Failed to import configuration. The file may be invalid.
zh_cn: 配置导入失败，文件可能无效。

# Settings_ExportHistorySuccess
source: History records exported successfully.
zh_cn: 历史记录导出成功。

# Settings_ExportHistoryFailed
source: Failed to export history records.
zh_cn: 历史记录导出失败。

# Settings_ExportHistoryMode_Title
source: Export History
zh_cn: 导出历史记录

# Settings_ExportHistoryMode_Description
source: Choose whether to export to a local file or directly to the cloud.
zh_cn: 选择要导出到本地文件，还是直接导出到云端。

# Settings_ImportHistoryConfirmTitle
source: Import History
zh_cn: 导入历史记录

# Settings_ImportHistoryMode_Title
source: Import History
zh_cn: 导入历史记录

# Settings_ImportHistoryMode_Description
source: Choose whether to import from a local file or directly from the cloud.
zh_cn: 选择从本地文件导入，还是直接从云端导入历史记录。

# Settings_ImportHistoryConfirmContent
source: Choose how to import: Merge will add non-duplicate records to the existing history. Replace will overwrite all existing records.
zh_cn: 选择导入方式：合并会将不重复的记录添加到现有历史中；替换会覆盖所有现有记录。

# Settings_ImportHistoryMerge
source: Merge
zh_cn: 合并

# Settings_ImportHistoryReplace
source: Replace
zh_cn: 替换

# Settings_ImportHistorySuccess
source: {0} history records imported successfully.
zh_cn: 成功导入 {0} 条历史记录。

# Settings_ImportHistoryFailed
source: Failed to import history records. The file may be invalid.
zh_cn: 历史记录导入失败，文件可能无效。

# Config_ExportSuccess
source: Configuration exported to: {0}
zh_cn: 配置已导出到：{0}

# Config_ExportFailed
source: Failed to export configuration: {0}
zh_cn: 配置导出失败：{0}

# Config_ImportSuccess
source: Configuration imported from: {0}
zh_cn: 配置已从 {0} 导入

# Config_ImportFailed
source: Failed to import configuration: {0}
zh_cn: 配置导入失败：{0}

# Config_ImportFailed_Null
source: Failed to import configuration: parsed result is null.
zh_cn: 配置导入失败：解析结果为空。

# History_ExportSuccess
source: History exported to: {0}
zh_cn: 历史记录已导出到：{0}

# History_ExportFailed
source: Failed to export history: {0}
zh_cn: 历史记录导出失败：{0}

# History_ImportSuccess
source: {0} history records imported.
zh_cn: 已导入 {0} 条历史记录。

# History_ImportFailed
source: Failed to import history: {0}
zh_cn: 历史记录导入失败：{0}

# SettingsPage_ToastNotificationLevel.Text
source: System notification level
zh_cn: 系统通知等级

# SettingsPage_ToastNotificationLevelDesc.Text
source: Controls when system pop-up notifications (Toast) are sent; in-app notifications are not affected
zh_cn: 控制何时发送系统弹窗通知（Toast），应用内通知不受影响

# SettingsPage_ToastLevel_Off.Content
source: Off
zh_cn: 关闭

# SettingsPage_ToastLevel_ErrorOnly.Content
source: Errors only
zh_cn: 仅错误

# SettingsPage_ToastLevel_ImportantAndAbove.Content
source: Important and above
zh_cn: 重要及以上

# SettingsPage_ToastLevel_All.Content
source: All
zh_cn: 全部

# Notification_Important_Title
source: Important
zh_cn: 重要通知

# SettingsPage_About_Link_KnotLink.Content
source: About KnotLink (GitHub)
zh_cn: KnotLink 项目主页

# Schedule_Every
source: Every
zh_cn: 每一

# Schedule_Header
source: Scheduled Backup Tasks
zh_cn: 计划备份任务

# Schedule_Description
source: Configure scheduled backup plans. Select "Every" for wildcard (e.g. "Every" month means run monthly). When Day is "Every", Month is ignored.
zh_cn: 配置定时备份计划。选择"每一"表示通配（如"每一"月意味着每月执行）。当"日"为"每一"时，"月"将被忽略。

# Schedule_Add
source: Add Schedule
zh_cn: 添加计划

# Schedule_Month
source: M
zh_cn: 月

# Schedule_Day
source: D
zh_cn: 日

# Schedule_NextRun
source: Next run: {0}
zh_cn: 下次执行: {0}

# ConfigSettingsDialog_Cloud.Header
source: Cloud
zh_cn: 云

# ConfigSettingsDialog_Cloud.Text
source: Cloud
zh_cn: 云

# ConfigSettingsDialog_CloudGuideTip.Text
source: New to cloud sync? Start with the official guide.
zh_cn: 首次使用云同步？可先查看官网引导。

# ConfigSettingsDialog_CloudGuideOpen.Content
source: Open website
zh_cn: 打开官网

# ConfigSettingsDialog_CloudGuideOpenFailed
source: Failed to open website: {0}
zh_cn: 打开官网失败：{0}

# ConfigSettingsDialog_TabGeneral.Text
source: General
zh_cn: 常规

# ConfigSettingsDialog_TabBackup.Text
source: Backup
zh_cn: 备份

# ConfigSettingsDialog_TabRestore.Text
source: Res
zh_cn: 还原

# ConfigSettingsDialog_TabAutomation.Text
source: Auto
zh_cn: 自动化

# ConfigSettingsDialog_TabCloud.Text
source: Cloud
zh_cn: 云

# ConfigSettingsDialog_TabFilter.Text
source: Filter
zh_cn: 过滤

# ConfigSettingsDialog_CloudEnabled.Header
source: Enable post-backup cloud upload
zh_cn: 启用备份后云上传

# ConfigSettingsDialog_CloudEnabled.OnContent
source: On
zh_cn: 开启

# ConfigSettingsDialog_CloudEnabled.OffContent
source: Off
zh_cn: 关闭

# ConfigSettingsDialog_CloudMode.Header
source: Execution mode
zh_cn: 运行方式

# ConfigSettingsDialog_CloudModeRclone.Content
source: rclone simple mode
zh_cn: rclone 简易模式

# ConfigSettingsDialog_CloudModeCustom.Content
source: Advanced custom command
zh_cn: 高级自定义命令

# ConfigSettingsDialog_CloudRemoteBasePath.Text
source: Remote base path
zh_cn: 远端基路径

# ConfigSettingsDialog_CloudRemoteBasePathPlaceholder.PlaceholderText
source: For example: remote:FolderRewind
zh_cn: 例如 remote:FolderRewind

# ConfigSettingsDialog_CloudRemoteBasePathDesc.Text
source: Enter an rclone connection and folder, such as remote:FolderRewind.
zh_cn: 填写 rclone 中的连接名称和目录，例如 remote:FolderRewind。

# ConfigSettingsDialog_CloudTemplate.Header
source: Template
zh_cn: 预设模板

# ConfigSettingsDialog_CloudTemplateArchive.Content
source: Upload current archive only (recommended)
zh_cn: 上传当前归档文件（推荐）

# ConfigSettingsDialog_CloudTemplateDirectory.Content
source: Upload current backup directory
zh_cn: 补传当前备份目录
